#Задача 1. Площадь прямоугольника
a=float(input("Введите значение длины прямоугольника"))
b=float(input("Введите значение ширины прямоугольника"))
p=(a+b)*2
s=a*b
print ("Периметр прямоугольника равен",p)
print ("Площадь прямоугольника равна",s)
